src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/modules/OpenQBMM/tutorials/pbeTransportFoam/TaylorCouette/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "wedge.*"
    {
        type            wedge;
    }
    innerWall
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 1 0);
        omega           17.278759575;  // 165 RPM
    }
    outerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            symmetry;
    }
    outlet
    {
        type            slip;
    }
}

// ************************************************************************* //
